# Insulation Material Methods

Source: https://www.revitapidocs.com/2026/acab5002-2087-a38a-18cf-8177fc905fc1.htm

---

| Insulation Material Methods |
| --- |

The InsulationMaterial type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Conductor Insulation Material. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetInsulationMaterial | Gets the Conductor Insulation Material data by given Conductor Insulation Material id. |
|  | GetInsulationMaterialIdByName | Gets the Conductor Insulation Material id by given Conductor Insulation Material name. |
|  | GetInsulationMaterialIds | Gets all the Conductor Insulation Material ids in the given document, sorted by name. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

InsulationMaterial Class Autodesk.Revit.DB.Electrical Namespace